## Сюжетное наполнение, миссии

### Миссия 1

* **Катсцена:** вступительная к эпохе

Племя Орла подверглось нападению. Шум, гам, резня. Главный герой, Рукк, сражается с нападающими варварами, видит, как его отца-вождя убивает огромный воин - вождь племени Тигра Хан. Герою ничего не остается, кроме как сбежать в лес.

* **Ролик:** воспоминание (стилизация под наскальную живопись)

_Молодой Рукк проходит "испытание чащей". Его цель - добыть перо из гнезда на Скале орла. Он должен выживать совсем один в глухом лесу._

#### Геймплей

* **Цель: [Найти выживших]**
* **Задача: [Создать Костер]**

Рукк оказывается посреди леса. Первым делом он должен собрать немного ресурсов, чтобы развести огонь. Костер станет центром поселения, его дым привлечет других выживших.

* **Задача: [Построить Хижины]**

С помощью соплеменников Рукк добывает еще больше ресурсов и строит хижины. Так племя Орла начнет снова потихоньку разрастаться.

* **Цель: [Защитить новое племя]**
* **Задача: [Добыть N припасов]**

Новых жителей нужно прокормить. Рукк и соплеменники занимаются охотой и собирательством, добывая нужное количество ресурсов.

* **Задача: [Отбиться от хищников]**

Вдруг на еще маленькое и слабое поселение нападают хищники. Племя во главе с Рукком отбиваются от них. Рукк понимает, что несет ответственность за этих людей, он должен обучить их и позаботиться об их защите.

---

### Миссия 2

_По сути обучающая миссия, в которой упор стоит на освоение механик, а не сюжет. Игрок научится подстраиваться под глобальные события, строить разные постройки, обучать юнитов и сражаться._

* **Ролик:** воспоминание (стилизация под наскальную живопись)

#### Геймплей

Молодой Рукк успешно продвигается через лес. Но его начинает преследовать саблезубый тигр.

* **Цель: [Развить поселение]**
* **Задача: [Собрать N ресурсов]**

Рукк расширяет свое поселение. Происходят _“глобальные события”_ (Пожар, Дождь и т.д.), которые влияют на сбор ресурсов и их качество. Например, **Дождь** снижает качество древесины, и ее нужно больше для построек. **Пожар** уничтожает зону добычи ресурсов, нужно искать новую, и т.д.

* **Задача: [Построить хранилища для ресурсов]**

Рукк строит полезные постройки, которые помогают увеличить лимит хранимых ресурсов и защитить их от влияния "глобальных событий".

* **Цель: [Обеспечить оборону поселения]**
* **Задача: [Построить частокол вокруг поселения и “казармы”, обучить воинов.]**

Теперь, когда поселению не грозит голодная смерть, Рукк занимается его обороной: строит частокол и обучает воинов.

* **Задача: [Отбить атаку варваров]**

На поселение нападают воины племени Тигра во главе с Ханом. Используя созданные постройки и юнитов, Рукк отбивает их атаку. Хан обещает вернуться и снова уничтожить Племя Орла.

---

### Миссия 3

* **Ролик:** воспоминание (стилизация под наскальную живопись)

Молодой Рукк сталкивается с саблезубым тигром, но ему везет - ядовитая змея атакует зверя и отвлекает его, давая Рукку возможность сбежать. Рукк добирается до вершины Скалы орла и добывает перо. Ему нужно идти назад.

#### Геймплей

* **Цель: [Исследовать местность]**
* **Задача: [Построить "казармы" (разведчики) и обучить юнитов]**

Рукк понимает, что варвары будут продолжать нападать на его племя. Он должен взять под контроль больше территории и построить другие поселения, которые смогут сдерживать натиск "тигров". Для исследования территории и поиска подходящих мест для лагерей Рукк должен обучить разведчиков, юнитов дальнего боя с бОльшим полем обзора. 

* **Задача: [Найти хорошее место для еще одного поселения]**

Рукк с отрядом разведчиков находит место для нового лагеря и закладывает там еще одно поселение.

* **Цель: [Встретить незваных гостей]**
* **Задача: [Выслушать посланника]**

Вернувшись в основной лагерь Рукк узнает, что у него гости: воины племени Змеи. Они пришли с предупреждением от их вождя, Снарка: если племя Орла будет захватывать их земли, “змеи” объявят войну и уничтожат каждого “орла”. 

* **Задача: [Решить судьбу воинов Змеи]**

Рукк может выбрать - убить "гонцов" или отпустить их. С одной стороны, "змеи" участвовали в той резне вместе с "тиграми", а значит, заслуживают кары. С другой стороны - они не желают продолжать вражду и просто хотят жить сами по себе. В любом случае вождь племени Змеи, Снарк, запомнит решение Рукка, оно повлияет в будущем.

---

### Миссия 4

* **Ролик:** воспоминание (стилизация под наскальную живопись)

Молодой Рукк спускается со скалы, и его вновь настигает тигр. Рукк решает показать зверю, что он сильнее и опаснее и вступает с ним в бой. Терпит неудачу и получает страшную рану от когтей, спасается, прыгнув в реку и спрятавшись.

#### Геймплей

* **Цель: [Продолжить развивать поселение]**
* **Задача: [Построить "казармы" и обучить юнитов]**

Рукк строит новые здания и осваивает новые технологии. Шаман предупреждает Рукка: духи сообщили ему, что с одним из поселений Орла произошла беда. 

* **Задача: [Убить захватчиков]**

Рукк прибывает на место с отрядом и обнаруживает варваров из племени Тигра, которые сожгли поселение. Рукк в гневе, он решает, что пришло время отомстить своим врагам. 

* **Цель: [Отомстить Тигру]**
* **Задача: [Найти Хана]**

Рукк отправляется в главное поселение “тигров”, но по прибытии обнаруживает почти неприступную крепость в скалах. Сил племени Орла не хватит, чтобы взять ее.

* **Задача: [Уничтожить варваров]**
* **Задача: [Убить Хана]**

Воины племени Тигра легко побеждают отряд Рукка. Хан лично выходит к герою и почти убивает его в схватке. Однако он позволяет воинам-”орлам” забрать своего лидера. Хан играет в милосердие: Рукк вызывает у него презрение, но вождь-Тигр оценил его смелость и ярость. Он решил дать Рукку шанс подготовиться: вскоре огромный отряд варваров придет и истребит все племя Орла - еще раз. Он говорит Рукку, чтобы его люди завершали все свои дела - "тигры" придут к ним еще до полной луны. Сраженного и опозоренного Рукка уносят домой его воины.

---

### Миссия 5

_Принятое игроком ранее решение даст здесь свой результат, и ему выпадет возможность сделать более важный выбор, который потенциально может повлиять не только на сюжет "Темной эпохи", но и на развитие в следующих эпохах. (Ну так, в порядке бреда)_

* **Ролик:** воспоминание (стилизация под наскальную живопись)

Молодой Рукк залечивает рану от когтей. Он понимает, что сильного противника нельзя победить силой, нужно использовать его слабости. Герой изучает местность и находит змеиное логово. Он решает заманить в него тигра.

#### Геймплей

* **Цель: [Решить судьбу племени Змеи]**
* **Задача: [Найти Снарка]**

Племя Орла начинает готовиться к нападению “тигров”. Но первым делом Рукк планирует решить вопрос с племенем Змеи: заручиться их поддержкой в битве или устранить лишнего противника, чтобы не вышло, как в прошлый раз.

* **Задача: [Добраться до Снарка]**

Рукк собирает отряд и выслеживает поселение Змеи. Здесь возможна развилка: если Рукк убил посланников Змеи, когда они приходили к нему, то придется прорываться к вождю Снарку с боем. Если же он их отпустил, то и Змеи встретят Рукка и его воинов мирно. В любом случае Снарк откажется участвовать в битве и не даст своих воинов, но готов поделиться с “орлами” технологией отравленного оружия в качестве искупления вины за прошлое. 

* **Задача: [Решить судьбу Снарка]**

Рукку снова нужно сделать выбор: согласиться на эти условия и уйти только с технологией, либо убить Снарка, чтобы подчинить себе племя Змеи и получить еще воинов. Результат выбора: если согласиться, Снарк откроет еще и секреты, как можно использовать змеиный яд для лечения _(в следующей эпохе будет плюс к медицине, например)_; если убить его - Рукк не узнает о целебных свойствах яда, но получит дополнительных юнитов Змеи.

---

### Миссия 6 - (на время)

* **Ролик:** воспоминание (стилизация под наскальную живопись)

Молодой Рукк заманивает тигра в змеиное логово. Пока зверь отвлечен, Рукк высекает камнями искру и поджигает палку - с помощью огня он убивает тигра и возвращается в племя в его шкуре, как герой.

#### Геймплей

* **Цель: [Подготовиться к обороне]**
* **Задачи: [Подготовить ловушки / Обучить воинов / и т.д.]**

Осталось совсем мало времени до нападения племени Тигра. Рукк готовится к обороне, строит укрепления, обучает юнитов, пользуется бонусом, полученным в предыдущей миссии (от убийства/помилования Снарка). Рукк использует окружающую местность и ландшафт, чтобы изготовить ловушки и продумать стратегию обороны. 

* **Цель: [Победить племя Тигра]**
* **Задачи: [Отбить первую (и последующие) атаку]**

Когда время выходит, на поселение нападает орда варваров - племя Тигров в полном составе и с вождем Ханом во главе. Рукк держит оборону и сходится в битве с главным врагом. 

* **Задача: [Победить Хана]**

В решающий момент Рукк вызывает Хана на личный поединок - за титул вождя племени Тигра. Хан не имеет права отказаться, в прочем он и не сомневается в себе. Рукк в тяжелом бою убивает Хана, и все выжившие варвары клянутся ему в верности.

* **Катсцена:**

Герой забирает у Хана его шкуру саблезубого тигра и надевает на себя (так же, как и в прошлом). Воины обоих племен, Орла и Тигра, выражают ему всяческие почести. Рукк признает себя вождем и обещает себе вести свое большое племя к процветанию и развитию.

## Племя Орла отомщено, оно возродилось и стало полноправными хозяевами этих земель.